[
  {
    "clubId": 1,
    "year": "2025",
    "lastUpdated": "15/02/2025",
    "sections": [
      {
        "id": "inscricao",
        "title": "Inscrição e Participação",
        "iconName": "Shield",
        "content": [
          "As inscrições devem ser realizadas pelo site oficial com pelo menos 24 horas de antecedência ao evento.",
          "O piloto deve estar em dia com a taxa de associação ao clube.",
          "Pilotos menores de 18 anos precisam de autorização dos responsáveis legais.",
          "Cada piloto é responsável por verificar seu equipamento de segurança antes do evento.",
          "É obrigatório o uso de capacete, luvas e macacão durante as competições."
        ]
      },
      {
        "id": "categorias",
        "title": "Categorias",
        "iconName": "Flag",
        "content": [
          "<strong>Light:</strong> Para pilotos iniciantes e intermediários, com experiência inferior a 2 anos em competições oficiais.",
          "<strong>Pro:</strong> Para pilotos com experiência comprovada em competições anteriores, incluindo pódios em campeonatos regionais.",
          "A direção de prova pode solicitar a mudança de categoria caso o desempenho do piloto esteja incompatível com sua categoria atual.",
          "Pilotos estreantes iniciam obrigatoriamente na categoria Light, com possibilidade de promoção após completar um campeonato completo."
        ]
      },
      {
        "id": "formato",
        "title": "Formato das Corridas",
        "iconName": "Hash",
        "content": [
          "Todos os eventos contam com tomada de tempo (15 minutos) e corrida principal (duração variável conforme a etapa).",
          "O grid de largada é definido pelo resultado da tomada de tempo.",
          "A quantidade de voltas varia de acordo com o evento e é informada no briefing, tipicamente entre 15 e 25 voltas.",
          "Em caso de chuva, a direção de prova pode alterar a duração ou formato da corrida, priorizando a segurança dos pilotos.",
          "As largadas são realizadas em movimento, com os karts alinhados em duas filas."
        ]
      },
      {
        "id": "pontuacao",
        "title": "Pontuação e Classificação",
        "iconName": "Award",
        "content": [
          "1º lugar: 35 pontos",
          "2º lugar: 30 pontos",
          "3º lugar: 27 pontos",
          "4º lugar: 25 pontos",
          "5º lugar: 23 pontos",
          "Do 6º ao 20º lugar: pontuação decrescente (22, 21, 20...)",
          "Volta mais rápida: 1 ponto adicional",
          "Pole position: 1 ponto adicional",
          "Para a classificação final do campeonato, descarta-se o pior resultado do piloto ao longo da temporada.",
          "Em caso de empate na pontuação final, o desempate será feito por: 1) Número de vitórias; 2) Número de segundos lugares; 3) Número de poles."
        ]
      },
      {
        "id": "penalidades",
        "title": "Penalidades",
        "iconName": "AlertTriangle",
        "content": [
          "Advertência: para infrações leves, sem consequências para outros competidores.",
          "Drive-through: o piloto deverá passar pelos boxes sem parar, respeitando o limite de velocidade.",
          "Stop and Go: o piloto deverá parar na área de box por 10 segundos e depois retornar à pista.",
          "Exclusão da prova: em casos de conduta antidesportiva grave ou reincidência.",
          "As penalidades são aplicadas pelos comissários de prova e são inapeláveis.",
          "Contatos que resultem em vantagem indevida ou prejudiquem outro competidor serão penalizados.",
          "Manobras de defesa com mudança de direção na freada serão penalizadas."
        ]
      },
      {
        "id": "equipamentos",
        "title": "Equipamentos e Segurança",
        "iconName": "Scale",
        "content": [
          "Todos os karts são sorteados antes da tomada de tempo para garantir igualdade de condições.",
          "É permitido ajuste de banco e pedais, mas não são permitidas modificações nos karts.",
          "O peso mínimo do conjunto piloto+kart é de 180kg para todas as categorias.",
          "Pilotos abaixo do peso mínimo devem utilizar lastros fornecidos pela organização.",
          "O uso de equipamentos de segurança (capacete, luvas, sapatilha e macacão) é obrigatório.",
          "Todos os equipamentos devem estar em boas condições de conservação.",
          "A organização se reserva o direito de vetar o uso de equipamentos considerados inadequados."
        ]
      },
      {
        "id": "conduta",
        "title": "Código de Conduta",
        "iconName": "Info",
        "content": [
          "Todos os pilotos devem participar do briefing antes da corrida.",
          "Comportamento agressivo ou antidesportivo dentro ou fora da pista resultará em penalidades.",
          "Pilotos devem respeitar as sinalizações e instruções dos fiscais de pista.",
          "É proibido o consumo de álcool ou substâncias ilícitas antes ou durante os eventos.",
          "Reclamações ou questionamentos devem ser feitos formalmente à direção de prova, através de formulário específico.",
          "A organização se reserva o direito de exclusão de participantes que descumpram gravemente as regras ou apresentem comportamento prejudicial ao evento."
        ]
      }
    ]
  },
  {
    "clubId": 2,
    "year": "2025",
    "lastUpdated": "10/01/2025",
    "sections": [
      {
        "id": "inscricao",
        "title": "Inscrição e Participação",
        "iconName": "Shield",
        "content": [
          "Inscrições devem ser feitas exclusivamente pelo aplicativo oficial do clube até 48h antes do evento.",
          "Membros do clube têm prioridade na confirmação de inscrição até 72h antes do evento.",
          "Pilotos menores de 16 anos devem apresentar autorização assinada e reconhecida em cartório.",
          "Taxa de inscrição deve ser paga integralmente até 24h antes do evento.",
          "Cada piloto deve ter seu próprio equipamento de segurança, não sendo permitido compartilhamento."
        ]
      },
      {
        "id": "categorias",
        "title": "Categorias",
        "iconName": "Flag",
        "content": [
          "<strong>Light:</strong> Para pilotos iniciantes com até 1 ano de experiência em campeonatos.",
          "<strong>Pro:</strong> Para pilotos com experiência intermediária e até 2 pódios em campeonatos regionais.",
          "<strong>Master:</strong> Para pilotos com mais de 35 anos ou com vasta experiência em campeonatos.",
          "A comissão técnica avaliará o desempenho dos pilotos e poderá reclassificá-los a qualquer momento do campeonato."
        ]
      },
      {
        "id": "formato",
        "title": "Formato das Corridas",
        "iconName": "Hash",
        "content": [
          "Treino livre (10 minutos), classificação (10 minutos) e corrida (30 minutos ou 25 voltas).",
          "Grid invertido para os 6 primeiros colocados na segunda corrida de cada etapa.",
          "Sistema de handicap para equilibrar competitividade: lastros adicionais para os 3 primeiros colocados do campeonato.",
          "Em etapas de chuva, a classificação pode ser substituída por grid aleatório determinado por sorteio.",
          "Pit-stop obrigatório nas corridas de endurance, com tempo mínimo de parada de 2 minutos."
        ]
      },
      {
        "id": "pontuacao",
        "title": "Pontuação e Classificação",
        "iconName": "Award",
        "content": [
          "1º lugar: 40 pontos",
          "2º lugar: 35 pontos",
          "3º lugar: 30 pontos",
          "4º lugar: 27 pontos",
          "5º lugar: 25 pontos",
          "Do 6º ao 25º lugar: pontuação decrescente (23, 21, 19...)",
          "Volta mais rápida: 2 pontos adicionais",
          "Pole position: 2 pontos adicionais",
          "Descarte dos 2 piores resultados no cálculo da pontuação final.",
          "Em caso de empate, o desempate seguirá: 1) Maior número de vitórias; 2) Maior número de poles; 3) Maior número de voltas mais rápidas."
        ]
      },
      {
        "id": "penalidades",
        "title": "Penalidades",
        "iconName": "AlertTriangle",
        "content": [
          "Sistema de cartões: amarelo (advertência), laranja (perda de 5 posições) e vermelho (desclassificação).",
          "Acúmulo de 3 cartões amarelos = 1 cartão laranja.",
          "Acúmulo de 2 cartões laranja = 1 cartão vermelho.",
          "Penalidades de tempo: 5 segundos, 10 segundos ou drive-through.",
          "Contatos intencionais resultam em penalidade automática de cartão laranja.",
          "Punições podem ser revisadas pela comissão após a corrida mediante recurso formal.",
          "Comportamento antidesportivo fora da pista também está sujeito ao sistema de cartões."
        ]
      },
      {
        "id": "equipamentos",
        "title": "Equipamentos e Segurança",
        "iconName": "Scale",
        "content": [
          "Todos os karts passam por verificação técnica antes de cada etapa.",
          "Peso mínimo: 190kg (Light), 200kg (Pro) e 210kg (Master) para conjunto piloto+kart.",
          "Capacetes devem ter certificação SNELL, DOT ou equivalente e ter no máximo 5 anos de fabricação.",
          "Checagem aleatória de pneus e combustível será realizada após cada corrida para os 5 primeiros.",
          "Câmeras onboard são obrigatórias e devem estar funcionando durante toda a corrida.",
          "Telemetria é permitida apenas para análise pós-corrida, não sendo permitida comunicação em tempo real.",
          "A organização realiza sorteio de motores para garantir igualdade de condições."
        ]
      },
      {
        "id": "conduta",
        "title": "Código de Conduta",
        "iconName": "Info",
        "content": [
          "Briefing é obrigatório para todos os pilotos, com chamada nominal.",
          "O respeito entre competidores é princípio fundamental do clube.",
          "Reclamações sobre outros pilotos devem seguir o protocolo oficial com filmagem comprobatória.",
          "Pilotos suspensos não podem frequentar a área de box durante seu período de suspensão.",
          "Patrocinadores e convidados devem respeitar as áreas delimitadas para público.",
          "A comissão disciplinar se reúne semanalmente para avaliar eventuais incidentes não resolvidos durante a prova.",
          "Premiações e cerimônias de pódio são obrigatórias para os 3 primeiros colocados de cada categoria."
        ]
      }
    ]
  },
  {
    "clubId": 3,
    "year": "2025",
    "lastUpdated": "05/03/2025",
    "sections": [
      {
        "id": "inscricao",
        "title": "Inscrição e Participação",
        "iconName": "Shield",
        "content": [
          "Novos pilotos devem passar por avaliação prática antes de participar de corridas oficiais.",
          "Taxa de associação anual obrigatória, com pagamento parcelado disponível.",
          "Todos os pilotos devem ter seguro de acidentes pessoais válido.",
          "Pilotos menores de 18 anos devem ter acompanhamento de responsável durante todo o evento.",
          "Participação mínima em 70% das etapas para pontuação no campeonato."
        ]
      },
      {
        "id": "categorias",
        "title": "Categorias",
        "iconName": "Flag",
        "content": [
          "<strong>Rookie:</strong> Para pilotos iniciantes sem experiência prévia em competições.",
          "<strong>Graduação:</strong> Para graduados da categoria Rookie ou com experiência intermediária.",
          "<strong>Avançado:</strong> Para pilotos experientes com pelo menos 2 anos de competições.",
          "Promoção entre categorias é baseada em pontuação mínima e avaliação técnica."
        ]
      },
      {
        "id": "formato",
        "title": "Formato das Corridas",
        "iconName": "Hash",
        "content": [
          "Sistema de bateria classificatória + final para todas as categorias.",
          "Categoria Rookie: corridas mais curtas (15 voltas) com instrutor acompanhando.",
          "Graduação e Avançado: corridas de 20 e 25 voltas respectivamente.",
          "Formato especial de endurance trimestral com equipes de 2 a 3 pilotos.",
          "Corridas noturnas ocorrem uma vez por semestre com iluminação especial."
        ]
      },
      {
        "id": "pontuacao",
        "title": "Pontuação e Classificação",
        "iconName": "Award",
        "content": [
          "Sistema de pontuação progressivo com base no grid: P1 = 25 pts, P2 = 22 pts...",
          "Bonificação por superação: 0,5 ponto para cada posição ganha em relação ao grid.",
          "Pontos extras para evolução técnica (avaliado pelos instrutores): até 5 pontos por etapa.",
          "Corridas especiais (noturnas e endurance) têm pontuação em dobro.",
          "Campeonato anual com premiação para os 5 primeiros de cada categoria.",
          "Pontuação adicional por assiduidade: 2 pontos para cada etapa consecutiva participada.",
          "Sem sistema de descartes: todas as etapas contam para a pontuação final."
        ]
      },
      {
        "id": "penalidades",
        "title": "Penalidades",
        "iconName": "AlertTriangle",
        "content": [
          "Sistema educativo para Rookie: advertências verbais e orientação pós-corrida.",
          "Graduação e Avançado: sistema padrão de punições temporais e posicionais.",
          "Sessões obrigatórias de análise de incidentes com vídeo para pilotos penalizados.",
          "Piloto com 3 penalizações na mesma etapa: suspensão para a próxima corrida.",
          "Punições progressivamente mais severas para infrações repetidas.",
          "Aulas teóricas obrigatórias para pilotos com mais de 2 punições em sequência.",
          "Comitê de ética para análise de comportamentos anti-desportivos graves."
        ]
      },
      {
        "id": "equipamentos",
        "title": "Equipamentos e Segurança",
        "iconName": "Scale",
        "content": [
          "Academia disponibiliza equipamento completo para categoria Rookie.",
          "Graduação e Avançado: equipamentos próprios obrigatórios com inspeção periódica.",
          "Peso mínimo por categoria: Rookie (170kg), Graduação (180kg), Avançado (190kg).",
          "Karts da academia com revisão certificada antes de cada etapa.",
          "Equipamentos de telemetria disponíveis para aluguel, com análise técnica incluída.",
          "Seguro contra acidentes incluído na taxa de inscrição.",
          "Programa de desconto em equipamentos através das lojas parceiras."
        ]
      },
      {
        "id": "conduta",
        "title": "Código de Conduta",
        "iconName": "Info",
        "content": [
          "Ambiente de aprendizado: críticas construtivas são incentivadas, desrespeito não é tolerado.",
          "Mentoria entre pilotos experientes e novatos é parte da filosofia da academia.",
          "Sistema de tutoria: cada piloto Rookie tem um tutor da categoria Avançado.",
          "Participação em workshops técnicos trimestrais é obrigatória.",
          "Compromisso com evolução: avaliação periódica do desenvolvimento técnico de cada piloto.",
          "Conduta em redes sociais reflete os valores da academia - postagens ofensivas podem resultar em punições.",
          "Programa de embaixadores do esporte: pilotos destacados representam a academia em eventos promocionais."
        ]
      }
    ]
  },
  {
    "clubId": 4,
    "year": "2025",
    "lastUpdated": "22/01/2025",
    "sections": [
      {
        "id": "inscricao",
        "title": "Inscrição e Participação",
        "iconName": "Shield",
        "content": [
          "Processo seletivo obrigatório para novos membros, incluindo avaliação prática.",
          "Convite exclusivo para pilotos com histórico comprovado em competições de alto nível.",
          "Número máximo de 24 pilotos por categoria, com lista de espera para interessados.",
          "Compromisso de participação em todas as etapas do campeonato.",
          "Contrato de exclusividade para representantes oficiais da equipe."
        ]
      },
      {
        "id": "categorias",
        "title": "Categorias",
        "iconName": "Flag",
        "content": [
          "<strong>Elite:</strong> Para pilotos de alto desempenho com experiência nacional comprovada.",
          "<strong>Super Elite:</strong> Exclusivamente para campeões de campeonatos regionais reconhecidos.",
          "Análise de telemetria e tempos comparativos para alocação nas categorias.",
          "Reavaliação técnica semestral para todos os pilotos."
        ]
      },
      {
        "id": "formato",
        "title": "Formato das Corridas",
        "iconName": "Hash",
        "content": [
          "Formato profissional: treinos livres (2 sessões), classificação (15 min) e corrida (35 voltas).",
          "Sistema de corridas duplas em cada etapa com grid invertido parcial na segunda bateria.",
          "Corridas de longa duração (80 minutos) uma vez por trimestre.",
          "Qualificação em formato de Superpole para os 5 melhores tempos da classificação geral.",
          "Transmissão ao vivo de todas as corridas com comentaristas profissionais."
        ]
      },
      {
        "id": "pontuacao",
        "title": "Pontuação e Classificação",
        "iconName": "Award",
        "content": [
          "Sistema de pontuação FIA: 25, 18, 15, 12, 10, 8, 6, 4, 2, 1 pontos.",
          "Ponto extra para volta mais rápida e pole position.",
          "Desempate por maior número de primeiros lugares, seguido por segundos lugares e assim por diante.",
          "Descarte das 2 piores etapas no campeonato anual.",
          "Títulos oficiais registrados na federação estadual de automobilismo.",
          "Premiação financeira para os 3 primeiros colocados do campeonato.",
          "Sistema de handicap técnico para equilibrar desempenhos ao longo da temporada."
        ]
      },
      {
        "id": "penalidades",
        "title": "Penalidades",
        "iconName": "AlertTriangle",
        "content": [
          "Aplicação rigorosa do regulamento internacional com adaptações para kart amador.",
          "Penalizações de tempo: 5, 10 ou 20 segundos adicionados ao tempo final.",
          "Perda de posições no grid para infrações em classificação.",
          "Comissários de prova profissionais com experiência em competições nacionais.",
          "Recurso formal possível mediante pagamento de taxa, reembolsável em caso de ganho de causa.",
          "Sistema de pontos na carteira: acúmulo leva a suspensão automática.",
          "Análise obrigatória de telemetria e vídeo para todos os incidentes reportados."
        ]
      },
      {
        "id": "equipamentos",
        "title": "Equipamentos e Segurança",
        "iconName": "Scale",
        "content": [
          "Karts de competição com especificação técnica rigorosa e equalizada.",
          "Inspeção técnica completa antes e após cada etapa.",
          "Combustível fornecido pela organização, com análise química aleatória.",
          "Equipamentos de segurança de alto padrão: macacão nível 2, capacete SNELL/FIA, protetor cervical.",
          "Peso mínimo de 205kg para todas as categorias, com lastros fornecidos e lacrados.",
          "Componentes lacrados para evitar modificações entre as etapas.",
          "Toda a telemetria é armazenada pela organização para análise posterior."
        ]
      },
      {
        "id": "conduta",
        "title": "Código de Conduta",
        "iconName": "Info",
        "content": [
          "Padrão profissional de comportamento dentro e fora da pista.",
          "Entrevistas pós-corrida obrigatórias para os 3 primeiros colocados.",
          "Representação da equipe em eventos promocionais quando solicitado.",
          "Compromisso com patrocinadores, incluindo uso de material promocional.",
          "Conduta exemplar nas redes sociais, representando valores do esporte.",
          "Participação em eventos beneficentes organizados pela equipe.",
          "Proibição de associação com outros clubes durante a temporada vigente."
        ]
      }
    ]
  }
] 